Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/editor-omegat.tmx
Source language: en_us
Languages: pt_br

source: Infrastructure
pt_br: Infra-estrutura

source: The MIME lookup API.
pt_br: O MIME lookup API.

source: The MIME Lookup module provides API for looking up MIME type dependent settings, services and other objects.
pt_br: O módulo MIME Lookup implementa uma API para procurar por tipo MIME dependente de configurações, serviços e outros objetos.

source: It also provides SPI for implementing additional MIME type related data provider.
pt_br: Este também implementa SPI para implementação adicional do tipo MIME relatado pelo fornecedor de dados.

source: MIME Lookup On SystemFS
pt_br: MIME Lookup em SystemFS

source: The default implementation of MimeDataProvider.
pt_br: A implementação padrão do MimeDataProvider.

source: The MIME Lookup On SystemFS module implements MimeDataProvider that looks up objects in the folder hierarchy on the System filesystem.
pt_br: O MIME Lookup do módulo SystemFS implementa MimeDataProvider que procura objetos na hierarquia de pastas no sistema de arquivos.

source: Editing
pt_br: Edição

source: Enables editing of files in the IDE.
pt_br: Habilita a edição de arquivos no IDE.

source: The Editor module enables you to edit source files within the IDE.
pt_br: O módulo do editor habilita a edição de arquivos de código-fonte no IDE.

source: It provides syntax coloring for Java and HTML files, word matching, code completion, and other basic and advanced features.
pt_br: Fornece destaque colorido de sintaxe para arquivos Java e HTML, correspondência de palavra, auto-completar de código, e outras características básicas e avançada.

source: Java Indentation Engine
pt_br: Mecanismo de indentação Java

source: Simple Indentation Engine
pt_br: Mecanismo de indentação simples

source: Line Wrapping Indentation Engine
pt_br: Mecanismo de indentação com quebra de linhas

source: &Code Folds
pt_br: Dobramento de &código

source: Select in
pt_br: Selecionar em

source: Negative value is not allowed
pt_br: Valor negativo não é permitido

source: Value is out of range
pt_br: Valor fora do intervalo

source: {0} Toolbar
pt_br: Barra de ferramentas {0}

source: Toolbar contents customization
pt_br: Personalizar conteúdo da barra de ferramentas

source: Add Separator
pt_br: Adicionar separador

source: Generate Goto Popup
pt_br: Gerar pop-up de 'Ir para'

source: Generate Fold Popup
pt_br: Gerar pop-up de dobra

source: Go to &Source
pt_br: Ir para &código-fonte

source: Go to Super &Implementation
pt_br: Ir para super &implementação

source: Go to &Declaration
pt_br: Ir para &declaração

source: S&how Editor Toolbar
pt_br: Exi&bir barra de ferramentas do editor

source: &Show Line Numbers
pt_br: &Exibir número das linhas

source: &Back
pt_br: &Voltar

source: &Forward
pt_br: &Avançar

source: &Toggle Comment
pt_br: Alternar comentário

source: Co&mment
pt_br: Co&mentário

source: &Uncomment
pt_br: &Não Comentado

source: Shift &Left
pt_br: Deslocar à &esquerda

source: Shift &Right
pt_br: Deslocar à &direita

source: &Format
pt_br: &Formatar

source: Insert &Next Matching Word
pt_br: I&nserir próxima palavra correspondente

source: Insert &Previous Matching Word
pt_br: Inserir &palavra correspondente anterior

source: Select &All
pt_br: Selecionar &tudo

source: Select &Identifier
pt_br: Selecionar &identificador

source: Find Ne&xt
pt_br: Localizar pró&ximo

source: Find Pre&vious
pt_br: Localizar ante&rior

source: Find &Selection
pt_br: Localizar &seleção

source: Start &Macro Recording
pt_br: Iniciar gravação da &macro

source: Stop Macro Recordin&g
pt_br: Parar &gravação da macro

source: Remove &Trailing Spaces
pt_br: Remover espaços em brancos pos&teriores

source: Paste F&ormatted
pt_br: Colar f&ormatado

source: Print to &HTML...
pt_br: Imprimir em &HTML...

source: Print to HTML
pt_br: Imprimir em HTML

source: HTML File Name:
pt_br: Nome do arquivo HTML:

source: Browse...
pt_br: Procurar...

source: Show Line Numbers.
pt_br: Exibir número das linhas.

source: Open generated HTML in browser.
pt_br: Abrir HTML gerado no navegador.

source: Print only selected text.
pt_br: Imprimir somente o texto selecionado.

source: Can not create HTML file {0} in the folder {1}.
pt_br: O arquivo HTML {0} não pôde ser criado na pasta {1}.

source: Converts the document to HTML file
pt_br: Converte o documento para arquivo HTML

source: HTML file name
pt_br: Nome do arquivo HTML

source: Name of HTML file, where the converted context will be saved
pt_br: Nome do arquivo HTML, onde o contexto convertido será salvo.

source: B
pt_br: P

source: Browse
pt_br: Procurar

source: Browse the HTML file or directory
pt_br: Procurar o arquivo HTML ou diretório

source: Show line numbers
pt_br: Exibir número das linhas

source: Print also the line numbers into the HTML document
pt_br: Também imprimir o número das linhas no documento HTML

source: Open generated HTML in browser
pt_br: Abrir o HTML gerado no navegador

source: Print only selected text
pt_br: Imprimir apenas o texto selecionado

source: Only selected text will be converted to HTML file
pt_br: Apenas o texto selecionado poderá ser convertido para um arquivo HTML

source: HTML Files
pt_br: Arquivos HTML

source: Can not open document.
pt_br: Não pode abrir o documento.

source: File {0} already exists.
pt_br: Arquivo {0} já existe.

source: Overwrite?
pt_br: Sobrescrever?

source: Default
pt_br: Padrão

source: Identifier
pt_br: Identificador

source: Keyword
pt_br: Palavra-chave

source: Operator
pt_br: Operador

source: Comment
pt_br: Comentário

source: Number
pt_br: Número

source: Whitespace
pt_br: Espaço em branco

source: Error
pt_br: Erro

source: Character
pt_br: Caracteres

source: Separator
pt_br: Separador

source: Markup Element (Tag)
pt_br: Elemento de marcação (marcação)

source: Markup Attribute
pt_br: Atributo de marcação

source: Markup Attribute Value
pt_br: Valor do atributo de marcação

source: Entity Reference
pt_br: Referência de entidade

source: Constructor
pt_br: Construtor

source: Method
pt_br: Método

source: Field
pt_br: Campo

source: Local Variable
pt_br: Variável local

source: Method Parameter
pt_br: Parâmetro de método

source: Class
pt_br: Classe

source: Unused Element
pt_br: Elemento não utilizado

source: Deprecated Element
pt_br: Elemento obsoleto

source: Abstract Class or Method
pt_br: Classe abstrata ou método

source: Static Element
pt_br: Elemento estático

source: Private Element
pt_br: Elemento privado

source: Protected Element
pt_br: Elemento protegido

source: Public Element
pt_br: Elemento público

source: Selected Text
pt_br: Texto selecionado

source: Guarded Block
pt_br: Bloco protegido

source: Search Block
pt_br: Bloco de pesquisa

source: Status Bar
pt_br: Barra de status

source: Status Bar (highlighted)
pt_br: Barra de status (realçado)

source: Incremental Search
pt_br: Pesquisa incremental

source: Line Number
pt_br: Número da linha

source: Code Folding Bar
pt_br: Barra de código dobrável

source: Code Folding
pt_br: Dobramento de código

source: Highlight Search
pt_br: Realce da pesquisa

source: Highlight Caret Row
pt_br: Realce da linha do cursor

source: Caret Color
pt_br: Cor do cursor

source: Text Limit Line
pt_br: Linha de limite de texto

source: Synchronized text blocks
pt_br: Blocos de texto sincronizados

source: Editor Settings
pt_br: Configurações do editor

source: Plain Editor
pt_br: Editor simples

source: Editor State
pt_br: Estado do editor

source: Editor state.
pt_br: Estado do editor.

source: Abbreviations
pt_br: Abreviações

source: Abbreviations for commonly typed key sequences.
pt_br: Abreviações para as sequências de teclas mais utilizadas.

source: Insertion Point Blink Rate
pt_br: Taxa de Frequência do Ponto de Inserção

source: How fast the insertion point or overwrite caret blinks.
pt_br: Qual a velocidade do ponto de inserção ou cursor de substituição deve piscar.

source: Insertion Point Color
pt_br: Cor do ponto de inserção

source: Color of the insertion point.
pt_br: Cor do ponto de inserção.

source: Overwrite Caret Color
pt_br: Cor do cursor de substituição

source: Color of the caret when in overwrite mode.
pt_br: Cor do cursor no modo de substituição.

source: Italic Insertion Point
pt_br: Ponto de inserção em itálico

source: If True, the insertion point is italicized.
pt_br: Se 'verdadeiro', o ponto de inserção será em itálico.

source: Italic Overwrite Caret
pt_br: Cursor de substituição em itálico

source: If True, the caret is italicized when in overwrite mode.
pt_br: Se 'verdadeiro', o cursor ficará em itálico quando estiver no modo de substituição.

source: Insertion Point
pt_br: Ponto de inserção

source: Insertion point style.
pt_br: Estilo do ponto de inserção.

source: Overwrite Caret
pt_br: Cursor de substituição

source: Style of caret when in overwrite mode.
pt_br: Estilo do cursor quando estiver no modo de substituição.

source: Fonts and Colors
pt_br: Fontes e cores

source: Fonts and colors for various elements displayed in the Source Editor.
pt_br: Fontes e cores de vários elementos exibidos no editor de código-fonte.

source: Expand Tabs to Spaces
pt_br: Expandir tabulações para espaços

source: If True, automatically converts tabs in the document to spaces padded to the same column.
pt_br: Se 'verdadeiro', converte automaticamente as tabulações no documento para espaços alinhado na mesma coluna.

source: Font Size
pt_br: Tamanho da fonte

source: Default font size for tokens not assigned value in Fonts and Colors property.
pt_br: Tamanho da fonte padrão para símbolos sem valor determinado nas propriedades Fontes e Cores.

source: Curly Brace on Next Line
pt_br: Chaves na próxima linha

source: Curly brace on next line.
pt_br: Chaves na próxima linha.

source: Add Space Before Parentheses
pt_br: Adicionar espaço antes do parênteses

source: If True, add space before opening parenthesis.
pt_br: Se 'verdadeiro', adiciona um espaço antes de abrir o parênteses.

source: If True, highlight row where the insertion point is.
pt_br: Se 'verdadeiro', realça a linha onde o estiver o ponto de inserção.

source: Highlight Matching Bracket
pt_br: Realçar parênteses correspondente

source: Highlight bracket that matches the bracket before the insertion point.
pt_br: Realçar o parênteses antes do ponto de inserção.

source: Indentation Engine
pt_br: Mecanismo de indentação

source: Indentation engine used for this type of editor.
pt_br: Mecanismo de indentação utilizado para este tipo de editor.

source: Key Bindings
pt_br: Atalhos de teclas

source: Actions bound to shortcut keys.
pt_br: Ações vinculadas ao atalho de teclas.

source: Line Height Correction
pt_br: Correção da altura da linha

source: Multiplier by which to adjust line height.
pt_br: Multiplicador pelo qual ajusta a altura da linha.

source: Line Numbers
pt_br: &Número da linha

source: If True, line numbers in the document are displayed along the left side of the window.
pt_br: Se 'verdadeiro', o número das linhas será exibido no lado esquerdo da janela.

source: Click ellipsis button to display, edit, add, and remove macros.
pt_br: Clique no botão reticências para exibir, editar, adicionar e remover macros.

source: Margin
pt_br: Margem

source: Determines placement of margin.
pt_br: Determina a localização da margem.

source: Print Fonts and Colors
pt_br: Fontes e Cores na Impressão

source: Fonts and colors to use when printing document.
pt_br: Fontes e cores à utilizar ao imprimir o documento.

source: Print Line Numbers
pt_br: Imprimir Número das Linhas

source: If True, print line numbers.
pt_br: Se 'verdadeiro', imprime o número das linhas.

source: Scroll Find Insets
pt_br: Deslocar suplemento da pesquisa

source: Specifies how much space to reserve on each side of text located with the Find command.
pt_br: Especifica quanto espaço reservar em cada lado do texto localizado com o comando Localizar.

source: Scroll Jump Insets
pt_br: Suplemento de deslocamento de salto

source: How much the view should jump in each direction when scrolling goes off screen.
pt_br: Quanto a exibição deve pular em cada direção quando rolar fora da tela.

source: Number of Spaces per Indent
pt_br: Número de espaços por indentação

source: Number of spaces represented by one indentation level.
pt_br: Número de espaços representados por um nível de indentação.

source: Status Bar Caret Delay
pt_br: Tempo de espera do cursor da barra de status

source: Delay (in milliseconds) between time the caret stops moving and the update of its position in the status bar.
pt_br: Tempo de espera (em milisegundos) entre o tempo da pausa do movimento do cursor e a atualização da sua posição na barra de status.

source: Status Bar Visible
pt_br: Visibilidade da barra de status

source: If True, the status bar (showing insert mode, line number, and so on) is displayed at the bottom of the window.
pt_br: Se 'verdadeiro', a barra de status (exibindo modo de inserção, número das linhas, e mais) é exibida no final da janela.

source: Tab Size
pt_br: Tamanho da tabulação

source: Number of spaces per tab stop, for documents that contain real tabs.
pt_br: Número de espaços por parada de tabulação, para documentos que contenham tabulações reais.

source: Text Limit Line Color
pt_br: Cor da linha de limite de texto

source: Color of the line showing the text limit.
pt_br: Cor da linha que exibe o limite de texto.

source: Display Text Limit Line
pt_br: Exibir linha limite de texto

source: If True, display the text limit line.
pt_br: Se 'verdadeiro', exibe a linha limite de texto

source: Text Limit Character Count
pt_br: Contagem de caracter de limite do texto

source: Count of characters after which the text limit line is displayed.
pt_br: Contagem de caracteres depois que a linha de limite de texto é exibida.

source: Global Key Bindings
pt_br: Atalhos globais de teclas

source: Actions bound to shortcut keys for all editor types.
pt_br: Ações vinculadas ao atalho de teclas para todos os tipos de editores.

source: Show Toolbar
pt_br: Exibir barra de ferramentas

source: If True, display the editor toolbar.
pt_br: Se 'verdadeiro', exibe a barra de ferramentas do editor.

source: Text Antialiasing
pt_br: Suavização do texto

source: If True, text antialiasing will be used for font rendering.
pt_br: Se 'verdadeiro', a suavização do texto será utilizado na renderização de fonte.

source: Code Folding Properties
pt_br: Propriedades do dobramento de código

source: Auto Popup Completion Window
pt_br: Janela pop-up de auto-completar automática

source: If True, the completion window automatically appears when appropriate.
pt_br: Se 'verdadeiro', a janela de auto-completar aparecerá automaticamente quando apropriado.

source: Delay of Completion Window Auto Popup
pt_br: Tempo de espera da janela instantânea de auto-completar

source: How long to wait (in milliseconds) before automatically popping up the completion window.
pt_br: Quanto esperar (em milisegundo) antes de automaticamente exibir a janela instantânea de auto-completar.

source: Code Completion Instant Substitution
pt_br: Substituição instantânea do auto-completar de código

source: If True, invocation of code completion performs instant substitution, if the search result contains only one item
pt_br: Se 'verdadeiro', a invocação do auto-completar de código realiza uma substuição instantânea, se o resultado da busca contiver apenas um item

source: Auto Popup Javadoc Window
pt_br: Janela instantânea de Javadoc automática

source: If True, the Javadoc window automatically appears when appropriate.
pt_br: Se 'verdadeiro', a janela do Javadoc aparecerá automaticamente quando apropriado.

source: Delay of Javadoc Window Auto Popup
pt_br: Tempo de espera da janela instantânea de Javadoc automática

source: How long to wait (in milliseconds) before automatically popping up the Javadoc window.
pt_br: Quanto esperar (em milisegundos) antes de automaticamente exibir a janela Javadoc.

source: Background Color of Javadoc Popup Window
pt_br: Cor do segundo plano da janela instantânea do Javadoc

source: Background color of Javadoc popup window
pt_br: Cor do segundo plano da janela instantânea do Javadoc

source: Javadoc Preferred Size
pt_br: Tamanho preferencial do Javadoc

source: Preferred size of Javadoc popup window.
pt_br: Tamanho prefencial da janela instantânea do Javadoc.

source: Pair Character Completion
pt_br: Auto-completar par de caracteres

source: Turn on/off inserting of closing braces and other characters.
pt_br: Liga/desliga inclusão de fechamento de chaves e outros caracteres.

source: Regular text in document.
pt_br: Texto regular no documento.

source: regular text
pt_br: texto regular

source: Glyph and Line Number Margin
pt_br: Margem do ícone e número da linha

source: Line numbers and glyph icon maring along left side of document.
pt_br: Número das linhas e ícones que estão à margem esquerda do documento.

source: Selected text in document.
pt_br: Texto selecionado no documento.

source: selected text
pt_br: Texto selecionado

source: Text currently found during an incremental search.
pt_br: Texto encontrado durante uma busca incremental.

source: incremental search
pt_br: Pesquisa incremental

source: Search Selection
pt_br: Pesquisar seleção

source: Find in selected block of code
pt_br: Pesquisar em bloco selecionado de código

source: search selection
pt_br: Pesquisar seleção

source: Highlighted by Search
pt_br: Realçado pela pesquisa

source: Text highlighted after an incremental search.
pt_br: Texto realçado após uma pesquisa incremental.

source: highlight search
pt_br: Realce da pesquisa

source: Bookmark
pt_br: Marcador

source: Bookmark in document.
pt_br: Marcador no documento.

source: bookmark
pt_br: marcador

source: Guarded block (cannot be edited).
pt_br: Bloco protegido (não pode ser editado).

source: guarded block
pt_br: bloco protegido

source: Code folding icon in editor
pt_br: Ícone do dobramento de código no editor

source: Code folding side bar
pt_br: Barra lateral do dobramento de código

source: Regular status bar text.
pt_br: Texto regular da barra de status.

source: Search Wrapped
pt_br: Busca envolvida

source: Bold text in the status bar.
pt_br: Texto em negrito na barra de status.

source: Search wrapped
pt_br: Busca envolvida

source: Highlight Insertion Point Row
pt_br: Realçar a linha do ponto de inserção

source: Highlight the insertion point row.
pt_br: Realçar a linha do ponto de inserção

source: row text
pt_br: linha de texto

source: Matching Bracket
pt_br: Parênteses correspondente

source: Plain Text
pt_br: Texto puro

source: Plain text.
pt_br: Texto puro.

source: text
pt_br: texto

source: Erroneous Text
pt_br: Texto errôneo

source: Erroneous text.
pt_br: Texto errôneo.

source: error
pt_br: Erro

source: Version of the options.
pt_br: Versão das opções.

source: Version of the Options
pt_br: Versão das opções

source: Simple indentation engine.
pt_br: Mecanismo simples de indentação

source: Vertical Bar
pt_br: Barra vertical

source: Thin Vertical Bar
pt_br: Barra vertical fina

source: Solid Block
pt_br: Bloco sólido

source: Font
pt_br: Fonte

source: Inherit
pt_br: Herdar

source: I
pt_br: H

source: Foreground Color
pt_br: Cor do primeiro plano

source: Background Color
pt_br: Cor de plano de fundo

source: Preview
pt_br: Visualização

source: Color Preview
pt_br: Visualização de cor

source: Syntax:
pt_br: Sintaxe:

source: Coloring
pt_br: Coloração

source: DEFAULT
pt_br: Padrão

source: Actions:
pt_br: Ações:

source: Actions
pt_br: Ações

source: Keybindings:
pt_br: Atalhos:

source: K
pt_br: H

source: Add...
pt_br: Adicionar...

source: Remove
pt_br: Remover

source: Sort by Action
pt_br: Ordenar por ação

source: Sort by Name
pt_br: Ordenar por nome

source: Add Keybinding
pt_br: Adicionar atalho

source: Clear
pt_br: Limpar

source: C
pt_br: L

source: This shortcut sequence conflicts with sequence <{0}> bound to "{1}".
pt_br: Esta sequência de atalhos entra em conflito com a sequência <{0}> associada à "{1}".

source: Shortcut Sequence:
pt_br: Sequência do atalho:

source: Enter Abbreviation
pt_br: Forneça um abreviação

source: Abbreviation
pt_br: Abreviação

source: Expanded String
pt_br: String expandida

source: Edit...
pt_br: Editar...

source: Abbreviation:
pt_br: Abreviação:

source: Expansion:
pt_br: Expansão:

source: Abbreviation "{0}" already exists for "{1}".
pt_br: Abreviação "{0}" já existe para "{1}". \n

source: Replace with "{2}"?
pt_br: Substituir por "{2}"?

source: Enter Macro
pt_br: Informar macro

source: Macro <{0}> already exists.
pt_br: Macro <{0}> já existe.

source: Replace with the new content?
pt_br: Substituir pelo novo conteúdo?

source: Value should be in format [top[%],left[%],bottom[%],right[%]]
pt_br: Valor deve ser no formato [top[%],left[%],bottom[%],right[%]]

source: Invalid value entered
pt_br: Valor informado é inválido

source: Insets
pt_br: Suplementos

source: Top:
pt_br: Superior:

source: Bottom:
pt_br: Inferior:

source: Left:
pt_br: Esquerdo:

source: Right:
pt_br: Direito:

source: Fonts & Colors
pt_br: Fontes & cores

source: Font, background color, foreground color.
pt_br: Fonte, cor do plano de fundo, cor do primeiro plano.

source: Hit the action key to make the change.
pt_br: Pressione a tecla de ação para fazer a alteração.

source: Add
pt_br: Adicionar

source: Edit
pt_br: Editar

source: Annotation Types
pt_br: Tipos de anotação

source: All registered annotation types
pt_br: Todos os tipos de anotações registradas

source: Highlight Color
pt_br: Cor do realce

source: Color of the background highlight.
pt_br: Cor do plano de fundo do realçe.

source: Use Highlight Color
pt_br: Utilizar cor de realçe

source: If True, the highlight color is used.
pt_br: Se 'verdadeiro', a cor de realçe é utilizada.

source: Color of the text.
pt_br: Cor do texto.

source: Wave Underline Color
pt_br: Cor do sublinhado ondulado

source: Color of the wave underline.
pt_br: Cor do sublinhado ondulado.

source: Use Wave Underline
pt_br: Utilizar sublinhado ondulado

source: If True, the wave underline is used.
pt_br: Se 'verdadeiro', o sublinhado ondulado será utilizado.

source: Inherit Foreground Colors
pt_br: Herdar cores do primeiro plano

source: If True, the foreground color is used.
pt_br: Se 'verdadeiro', a cor do primeiro plano é utilizada.

source: Whole Line
pt_br: Linha inteira

source: If True, this annotation type is whole line annotation type.
pt_br: Se 'verdadeiro', este tipo de anotação é tipo de anotação de linha inteira.

source: KitClass {0} has not defined method getContentType().
pt_br: KitClass {0} não tem o métdo getContentType() definido.

source: It should not be displayed as node in Editor Settings.
pt_br: Não deveria ser exibido como nó nas configurações do editor.

source: Draw Glyphs on Background
pt_br: Desenhar ícones em segundo plano

source: If True, annotation glyphs that are covered by another annotation glyph are drawn on the background under the Source Editor text.
pt_br: Se 'verdadeiro', ícones de anotação que forem cobertos por outro ícone de anotação serão desenhados em segundo plano no texto do Editor de Código-Fonte.

source: Glyph Icon Alpha
pt_br: Alfa do ícone

source: Percentage of alpha value for the glyph icons that are drawn on the background.
pt_br: Percentual do valor alfa para ícones que estão desenhados em segundo plano.

source: Combine Annotations
pt_br: Combinar anotações

source: If True, annotation glyphs can be combined.
pt_br: Se 'verdadeiro', ícones de anotação podem ser combinados.

source: Draw Glyph Over Line Numbers
pt_br: Desenhar ícones sobre os números da linha

source: If True, glyph icons can be drawn over the line numbers.
pt_br: Se 'verdadeiro', ícones podem ser desenhados sobre os números da linha.

source: Always Show Glyph Margin
pt_br: Sempre exibir margem do ícone
